LedgerHQ/blue-nonsecure-firmware/build/stm32l476/src/ledger_ble.c
  /* Enable GPIO Ports Clock */  
  BNRG_SPI_RESET_CLK_ENABLE();
  BNRG_SPI_SCLK_CLK_ENABLE();
  BNRG_SPI_MISO_CLK_ENABLE();
  BNRG_SPI_MOSI_CLK_ENABLE();
  BNRG_SPI_CS_CLK_ENABLE();
  BNRG_SPI_IRQ_CLK_ENABLE();

  G_io_ble.powered = powered;
  
  if (powered) {
    // wait a bit
    //HAL_Delay(1000);
    
  #ifdef HAVE_BLE_MCU
    /* Initialize the BlueNRG HCI */
    HCI_Init();
  #endif // HAVE_BLE_MCU
    
    /* Enable SPI clock */
    BNRG_SPI_CLK_ENABLE();
    
    /* Reset */
    GPIO_InitStruct.Pin = BNRG_SPI_RESET_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_RESET_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_RESET_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_RESET_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_RESET_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);    
    BNRG_SPI_RESET_PORT->ODR &= ~BNRG_SPI_RESET_PIN;
    
    /* SCLK */
    GPIO_InitStruct.Pin = BNRG_SPI_SCLK_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_SCLK_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_SCLK_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_SCLK_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_SCLK_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_SCLK_PORT, &GPIO_InitStruct); 
    
    /* MISO */
    GPIO_InitStruct.Pin = BNRG_SPI_MISO_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_MISO_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_MISO_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_MISO_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_MISO_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_MISO_PORT, &GPIO_InitStruct);
    
    /* MOSI */
    GPIO_InitStruct.Pin = BNRG_SPI_MOSI_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_MOSI_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_MOSI_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_MOSI_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_MOSI_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_MOSI_PORT, &GPIO_InitStruct);
    
    /* NSS/CSN/CS */
    GPIO_InitStruct.Pin = BNRG_SPI_CS_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_CS_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_CS_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_CS_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_CS_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_CS_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_SET);

    /* IRQ -- INPUT + PULLDOWN to avoid DFU mode */
    GPIO_InitStruct.Pin = BNRG_SPI_IRQ_PIN;
    GPIO_InitStruct.Mode = BNRG_SPI_IRQ_MODE;
    GPIO_InitStruct.Pull = BNRG_SPI_IRQ_PULL;
    GPIO_InitStruct.Speed = BNRG_SPI_IRQ_SPEED;
    GPIO_InitStruct.Alternate = BNRG_SPI_IRQ_ALTERNATE;
    HAL_GPIO_Init(BNRG_SPI_IRQ_PORT, &GPIO_InitStruct);

    /* Configure the NVIC for SPI */  
    // clear up interrupts
    NVIC_ClearPendingIRQ(BNRG_SPI_EXTI_IRQn);
    NVIC_SetPriority(BNRG_SPI_EXTI_IRQn, 3);   

    /* Initialize the BlueNRG SPI driver */
    BNRG_SPI_Init();

    /* Reset BlueNRG hardware */
    BlueNRG_RST();

    HAL_NVIC_EnableIRQ(BNRG_SPI_EXTI_IRQn);

    // at least 3ms, and the irq must show up before sending the first command
    HAL_Delay(5);

#ifdef HAVE_BLE_MCU
    // probably not a good idea to do this each at each startup
    ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                    CONFIG_DATA_PUBADDR_LEN,
                                    SERVER_BDADDR
                                  );
    if(ret){
      PRINTF("Setting BD_ADDR failed.\n");
      THROW(EXCEPTION);
    }
    
    ret = aci_gatt_init();    
    if(ret){
      PRINTF("GATT_Init failed.\n");
      THROW(EXCEPTION);
    }
    
    #ifdef BLUENRG_MS
    ret = aci_gap_init(GAP_PERIPHERAL_ROLE, 0, 7, &G_io_ble.gap_service_handle, &G_io_ble.gap_dev_name_char_handle, &G_io_ble.gap_appearance_char_handle);
    #else
    ret = aci_gap_init(GAP_PERIPHERAL_ROLE, &G_io_ble.gap_service_handle, &G_io_ble.gap_dev_name_char_handle, &G_io_ble.gap_appearance_char_handle);
    #endif 
    
    if(ret != BLE_STATUS_SUCCESS){
      PRINTF("GAP_Init failed.\n");
      THROW(EXCEPTION);
    }
      
    // limit exchanges and data security to limit power, moreover apdus are public (f)
    ret = aci_gap_set_auth_requirement(MITM_PROTECTION_NOT_REQUIRED,
                                      OOB_AUTH_DATA_ABSENT,
                                      NULL,
                                      7,
                                      16,
                                      USE_FIXED_PIN_FOR_PAIRING,
                                      1337,
                                      NO_BONDING);
    if (ret != BLE_STATUS_SUCCESS) {
      PRINTF("BLE Stack Initialized.\n");
      THROW(EXCEPTION);
    }
    
    //PRINTF("SERVER: BLE Stack Initialized\n");
    ret = Add_Sample_Service();
    
    if(ret != BLE_STATUS_SUCCESS) {
      PRINTF("Error while adding service.\n");
      THROW(EXCEPTION);
    }
    
    /* Set output power level */
    ret = aci_hal_set_tx_power_level(1,7); // max power
    //ret = aci_hal_set_tx_power_level(0, 0); // lowest power
    if (ret) {
      THROW(EXCEPTION);
    }

    G_io_ble.apdu_available = 0;
  
    BLE_make_discoverable(discovered_name);
#endif // HAVE_BLE_MCU
  }
  else {
    // disable the interrupt when performing 
    HAL_NVIC_DisableIRQ(BNRG_SPI_EXTI_IRQn);
    
    BNRG_SPI_CLK_DISABLE();
    
    /* Reset */
    GPIO_InitStruct.Pin = BNRG_SPI_RESET_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    //GPIO_InitStruct.Mode = GPIO_MODE_ANALOG; // consume 4.5mA more, 0.95mA => 5.3mA,  NOT ACCEPTABLE
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(BNRG_SPI_RESET_PORT, &GPIO_InitStruct);       
    BNRG_SPI_RESET_PORT->ODR &= ~BNRG_SPI_RESET_PIN;
    
    /* SCLK */
    GPIO_InitStruct.Pin = BNRG_SPI_SCLK_PIN;
    HAL_GPIO_Init(BNRG_SPI_SCLK_PORT, &GPIO_InitStruct); 
    HAL_GPIO_WritePin(BNRG_SPI_SCLK_PORT, BNRG_SPI_SCLK_PIN, GPIO_PIN_RESET);
    
    /* MOSI */
    GPIO_InitStruct.Pin = BNRG_SPI_MOSI_PIN;
    HAL_GPIO_Init(BNRG_SPI_MOSI_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(BNRG_SPI_MOSI_PORT, BNRG_SPI_MOSI_PIN, GPIO_PIN_RESET);
    
    /* NSS/CSN/CS */
    GPIO_InitStruct.Pin = BNRG_SPI_CS_PIN;
    HAL_GPIO_Init(BNRG_SPI_CS_PORT, &GPIO_InitStruct);
    //HAL_GPIO_WritePin(BNRG_SPI_CS_PORT, BNRG_SPI_CS_PIN, GPIO_PIN_SET); // Consume 35mA more, driving current through the bluenrg chip for nothing.
    HAL_GPIO_WritePin(BNRG_SPI_SCLK_PORT, BNRG_SPI_SCLK_PIN, GPIO_PIN_RESET);
    
